{"ocr_results":[{"text":"“henchmen\", Zhang Chunqiao and Yao Wenyuan, were nothing more than two","box":[[229,173],[1009,175],[1009,198],[229,197]]},{"text":"sellouts of the Shanghai January Revolution and the latest“handful in power”who","box":[[226,239],[1051,238],[1051,262],[226,263]]},{"text":"were supporters of capitalism in China from this time on. When Zhang Chunqiao","box":[[225,303],[1034,302],[1034,329],[225,330]]},{"text":"sided with the rebel workers in the upsurge, he was portrayed as performing a","box":[[225,366],[1003,369],[1003,396],[225,393]]},{"text":"'good-cop bad-cop\" ploy with the workers, and \"they [Zhang Chunqiao and other","box":[[231,435],[1043,435],[1043,459],[231,459]]},{"text":"Maoists] took the side of the workers as a gambit tolead them into the hands of the","box":[[226,499],[1055,499],[1055,523],[226,523]]},{"text":"bourgeoisie. Once they had served their purpose for the capitalists, they were","box":[[225,562],[995,563],[995,590],[225,589]]},{"text":"themselves discarded.\" When the spate of economism flooded into Shanghai and","box":[[225,627],[1030,628],[1030,655],[225,654]]},{"text":"virtually bankrupted and paralyzed the city, PLP says that \"Mao and his gang'","box":[[228,694],[1003,695],[1003,719],[228,718]]},{"text":"\"dropped their centrist subtlety” and moved to crush the rebellion. Mao's initial","box":[[226,755],[1022,756],[1022,787],[226,786]]},{"text":"endorsement of the Commune, the PLP explains, merely demonstrated Mao's","box":[[225,822],[1000,823],[1000,850],[225,849]]},{"text":"intention to set up a new state, “different in form but essentially similar in content","box":[[226,888],[1046,889],[1046,913],[226,912]]},{"text":"replacing his own enemies with loyal aides, and making it appear to the workers that a","box":[[226,950],[1091,951],[1091,981],[226,980]]},{"text":"more profound change had taken place.\" Shanghai workers, according to PLP's","box":[[225,1018],[1019,1018],[1019,1045],[225,1045]]},{"text":"narrative,decided toform a Commune which decisively broke awaywith the new","box":[[225,1083],[1042,1084],[1042,1108],[225,1107]]},{"text":"democratic type state set up by the revolution of 1949. Yet after a while, the","box":[[225,1148],[980,1147],[980,1174],[225,1175]]},{"text":"Commune was replaced by the Triple Alliance due to Mao's \"attack\"of the Commune.","box":[[227,1215],[1093,1215],[1093,1238],[227,1238]]},{"text":"Thereason why the Shanghai workers were defeated in their fight to maintain the","box":[[228,1278],[1038,1279],[1038,1303],[228,1302]]},{"text":"Commune lay in the fact that the vast majority of them\"failed to perceive Mao as a","box":[[228,1344],[1061,1345],[1061,1369],[228,1368]]},{"text":"revisionist” due to the fatal personality cult. Therefore, “\"the actions of the Shanghai","box":[[226,1410],[1058,1410],[1058,1434],[226,1434]]},{"text":"workers in January 1967 stand as the first great rebellion against modern revisionism\",","box":[[227,1475],[1095,1475],[1095,1499],[227,1499]]},{"text":"91","box":[[645,1630],[668,1630],[668,1653],[645,1653]]}],"dimensions":{"height":1755,"width":1241}}