{"ocr_results":[{"text":"In 1998, Perry published an interesting article titled \"From Paris to the Paris of","box":[[300,175],[1090,175],[1090,198],[300,198]]},{"text":"the East and Back: Workers as Citizens in Modern Shanghai'', that discusses four","box":[[225,237],[1034,239],[1034,263],[225,261]]},{"text":"political confrontations in Shanghai that have changed the face of modern China","box":[[225,303],[1031,302],[1031,329],[225,330]]},{"text":"These movements are: the May Fourth Movement of 1919, the Three Armed","box":[[224,366],[990,368],[990,395],[224,393]]},{"text":"Uprisings of 1926-27, the Shanghai Commune in 1967, and the June Fourth Incident","box":[[227,432],[1073,432],[1073,462],[227,462]]},{"text":"of 1989. All of these events involved the crucial participation of the working class","box":[[224,497],[1046,499],[1046,526],[224,523]]},{"text":"Among these four events, the Three Armed Uprisings and the Shanghai Commune of","box":[[227,562],[1077,563],[1077,590],[227,589]]},{"text":"1967 were heavily influenced by the Paris Commune. The “ill-fated\" Shanghai","box":[[229,628],[1011,628],[1011,652],[229,652]]},{"text":"Commune in 1967, Perry held, demonstrated an effort to empower the proletariat in","box":[[226,693],[1061,695],[1061,719],[226,717]]},{"text":"the local government and is an embodiment of the political experimentation during","box":[[226,759],[1053,761],[1053,785],[226,783]]},{"text":"the CR. Perry differs from the Marxist analysis of the Shanghai Commune, in that she","box":[[227,825],[1083,825],[1083,849],[227,849]]},{"text":"insists that despite the rebels’rhetorical embrace of “class struggle,”the Shanghai","box":[[225,887],[1042,886],[1042,913],[225,914]]},{"text":"Commune, resonating with the earlier experiments in citizen rule such as the","box":[[227,954],[990,954],[990,978],[227,978]]},{"text":"Representative Congress of Shanghai in 1927, was just a bid for political inclusion (or","box":[[226,1018],[1086,1020],[1086,1044],[226,1042]]},{"text":"\"citizenship\"), rather than a battle against an “already moribund bourgeoisie\". In all","box":[[227,1081],[1062,1082],[1062,1109],[227,1108]]},{"text":"these events,Perry points out that there had been a noteworthy tendency for the","box":[[225,1148],[1017,1149],[1017,1173],[225,1172]]},{"text":"workers to downplay their own particular demands in favor of more universalistic","box":[[225,1213],[1043,1212],[1043,1238],[225,1239]]},{"text":"claims, and to subordinate workplace grievances in favor of playing the role of","box":[[225,1276],[1014,1277],[1014,1304],[225,1303]]},{"text":"citizens. She also discusses the worker-student relationship in these movements, and","box":[[227,1344],[1068,1344],[1068,1368],[227,1368]]},{"text":"notes not only the national significance of these movements, but also their","box":[[226,1410],[966,1410],[966,1434],[226,1434]]},{"text":"international implications that extended beyond the borders of China.“One of the","box":[[226,1475],[1039,1473],[1039,1497],[226,1499]]},{"text":"more arresting, yet relatively unexplored, features of modern protest movements,","box":[[224,1538],[1040,1539],[1040,1566],[224,1565]]},{"text":"98","box":[[646,1630],[669,1630],[669,1652],[646,1652]]}],"dimensions":{"height":1755,"width":1241}}