{"ocr_results":[{"text":"Chinese authorities, at least on the surface, because most of the presses in Hong Kong","box":[[225,169],[1082,175],[1082,201],[225,196]]},{"text":"and Taiwan are controlled by pro-capitalist owners. These anti-CR memoirs by old","box":[[226,237],[1053,237],[1053,264],[226,264]]},{"text":"Party or army officials and “scar literature\" by the privileged intellectuals all repeated","box":[[224,301],[1083,301],[1083,331],[224,331]]},{"text":"each other and distorted historical reality so much. And for this reason, many Chinese","box":[[226,367],[1079,369],[1079,393],[226,391]]},{"text":"readers lost interest in these works. In recent years, presses in Hong Kong and Taiwan","box":[[224,432],[1084,433],[1084,460],[224,459]]},{"text":"have chosen to publish many anti-CR memoirs by former rebel leaders. The","box":[[227,500],[981,500],[981,524],[227,524]]},{"text":"representative authors of these works include some former members of the CCRG in","box":[[226,564],[1071,564],[1071,588],[226,588]]},{"text":"the top leadership, such as Wang Li and Chen Boda, and some local rebel leaders,","box":[[227,630],[1040,630],[1040,654],[227,654]]},{"text":"such as Nie Yuanzi in Beijing, Lu Li'an in Wuhan, Yang Xiaokai, Chen Yi'nan in","box":[[224,692],[1037,693],[1037,720],[224,719]]},{"text":"Changsha, and Xu Jingxian and Chen Jide in Shanghai. Understandably, the negation","box":[[226,759],[1075,759],[1075,786],[226,786]]},{"text":"of the CR by these former “Maoist\" rebel leaders are perhaps more convincing and","box":[[226,824],[1055,824],[1055,851],[226,851]]},{"text":"effective in their demonization of the CR than that of the old privileged class such as","box":[[226,887],[1070,889],[1070,913],[226,911]]},{"text":"old Party officials or intellectuals. Lu Li'an, for example, a former ultra-leftist","box":[[228,954],[1006,954],[1006,978],[228,978]]},{"text":"“Maoist\"’ who claimed to carry through the CR to the end and “overthrow everything\",","box":[[227,1014],[1096,1016],[1096,1046],[227,1044]]},{"text":"now talks on the Free Asian Radio run by the American government - saying that","box":[[224,1082],[1040,1083],[1040,1111],[224,1110]]},{"text":"Mao was no more than a Hitler. Yang Xiaokai, another former ultra-leftist “Maoist\" in","box":[[223,1146],[1086,1147],[1086,1174],[223,1173]]},{"text":"Changsha had insisted on instituting a Chinese People's Commune in the wake of","box":[[226,1213],[1043,1212],[1043,1238],[226,1239]]},{"text":"Revolutionary Committee movement during the CR. Then, after the coup det'at in","box":[[226,1278],[1045,1279],[1045,1303],[226,1302]]},{"text":"1976, Yang totally abandoned his beliefs in communism and converted himself into a","box":[[230,1344],[1078,1344],[1078,1368],[230,1368]]},{"text":"Christian and a neo-liberal economist. It has been said that he had the potential to win","box":[[226,1408],[1079,1409],[1079,1433],[226,1432]]},{"text":"the Nobel Prize for economics, but unfortunately, Yang died in Australia in his","box":[[226,1473],[1006,1476],[1006,1500],[226,1497]]},{"text":"mid-fifties. These views about the CR in the Reform Era have deeply influenced","box":[[224,1537],[1028,1538],[1028,1565],[224,1564]]},{"text":"116","box":[[643,1631],[673,1631],[673,1652],[643,1652]]}],"dimensions":{"height":1755,"width":1241}}