{"ocr_results":[{"text":"the restoration of small-scale peasant farming which had lasted for more than one","box":[[225,154],[1039,155],[1039,181],[225,180]]},{"text":"thousandyears and caused countless famines in Chinesehistory-not the the","box":[[227,214],[990,214],[990,237],[227,237]]},{"text":"achievements during the Cultural Revolution such as thewater conservancy works.","box":[[227,271],[1054,271],[1054,295],[227,295]]},{"text":"the basic farmland construction drives and projects (nongtian jiben jianshe), the","box":[[225,326],[1022,327],[1022,355],[225,354]]},{"text":"building of numerous fertilizer and pesticide plants, and the introduction of hybrid","box":[[227,385],[1047,385],[1047,412],[227,412]]},{"text":"rice crop (zajiao shuidao). Deng Xiaoping used state funds that had been accumulated","box":[[225,442],[1086,441],[1086,468],[225,469]]},{"text":"for years during the MaoEra, to raise the workers'salaries.And then simultaneously.","box":[[226,501],[1074,503],[1074,527],[226,524]]},{"text":"Deng publicly denounced the so-called “persecution\" of the intellectuals by the “Gang","box":[[225,556],[1087,557],[1087,584],[225,583]]},{"text":"of Four”’ and promised to rapidly raise their wages and social status. In order to cater","box":[[224,613],[1073,614],[1073,644],[224,643]]},{"text":"to the intellectuals, the Deng regime purposely set up a \"Teacher's Day” on","box":[[225,672],[978,673],[978,700],[225,699]]},{"text":"September 10\", a day after Mao's death. One could say that, in a sense, this was a","box":[[226,728],[1045,727],[1045,757],[226,758]]},{"text":"festival to celebrate Mao's death. For several years, it seemed that everybody loved","box":[[226,788],[1056,788],[1056,815],[226,815]]},{"text":"Deng Xiaoping. Consequently, Mao and the Cutural Revolution were disregarded by","box":[[225,845],[1070,845],[1070,875],[225,875]]},{"text":"many Chinese people, including quite a number of peasants and workers. The true","box":[[226,903],[1045,903],[1045,930],[226,930]]},{"text":"history of the Cultural Revolution was meanwhile considerably blured, distorted and","box":[[226,961],[1069,961],[1069,985],[226,985]]},{"text":"coveredup.","box":[[226,1018],[340,1018],[340,1046],[226,1046]]},{"text":"Thisrecallshow today theFrenchworkers have ceased to commemorate the","box":[[300,1076],[1062,1075],[1062,1099],[300,1100]]},{"text":"Paris Commune. As Alain Badiou deplores, “little is remembered [about the Paris","box":[[223,1131],[1040,1132],[1040,1159],[223,1158]]},{"text":"Commune]... Does the working class have a heart?\" For about ten years after the","box":[[227,1192],[1029,1192],[1029,1216],[227,1216]]},{"text":"Cultural Revolution, similar questions were posed in post-Mao China as well. But the","box":[[226,1247],[1080,1247],[1080,1274],[226,1274]]},{"text":"bourgeoisie has never been reluctant to grow their own gravediggers. Due to the","box":[[226,1305],[1023,1307],[1023,1331],[226,1329]]},{"text":"division of land and individual farming (fen tian dan gan) promoted by the Deng","box":[[224,1358],[1034,1362],[1034,1392],[224,1388]]},{"text":"regime, Chinese agriculture was soon mired in great difficulties. This resulted in","box":[[225,1422],[1028,1420],[1028,1446],[225,1448]]},{"text":"burning and lasting \"sannong” issues, namely, rural problems pertaining to agriculture.","box":[[226,1479],[1093,1480],[1093,1504],[226,1503]]},{"text":"the villages, and the peasants. The need to address these rural issues is in part behind","box":[[226,1534],[1070,1535],[1070,1562],[226,1561]]},{"text":"2","box":[[651,1632],[664,1632],[664,1651],[651,1651]]}],"dimensions":{"height":1755,"width":1241}}