{"ocr_results":[{"text":"reality and reenvisioning the future of China?In some sense,the process of answering","box":[[227,158],[1085,158],[1085,181],[227,181]]},{"text":"these questions about the CR is a process of recovering a lost, or, a suppressed history.","box":[[226,212],[1087,215],[1087,239],[226,236]]},{"text":"The increasingly intensified struggle of the Chinese working people has made me","box":[[227,269],[1039,270],[1039,297],[227,296]]},{"text":"focus my study of the CR on the mass movements, especially workers’ movements.","box":[[227,327],[1058,328],[1058,355],[227,354]]},{"text":"And the most important, yet least explored workers’ movements during the CR took","box":[[228,386],[1065,386],[1065,413],[228,413]]},{"text":"place in Shanghai. Therefore, written from a political and historical point of view, my","box":[[225,443],[1076,444],[1076,471],[225,470]]},{"text":"dissertation is a close examination of the CR in Shanghai from 1966 and 1967. 1","box":[[226,501],[1028,501],[1028,527],[226,527]]},{"text":"explore this eventful period against the backdrop of the masses? collective activities,","box":[[228,558],[1066,556],[1066,583],[228,585]]},{"text":"including those of the workers, students, intellectuals, and peasants, both","box":[[229,617],[952,617],[952,641],[229,641]]},{"text":"conservatives and rebels. The rise and supersession of the Shanghai Commune during","box":[[225,669],[1081,674],[1081,701],[225,696]]},{"text":"the CR, a unique local state power organ created by the Shanghai masses modeled","box":[[228,730],[1045,730],[1045,757],[228,757]]},{"text":"upon the Paris Commune, will be my central focus. So far, mainstream scholarship on","box":[[227,790],[1082,789],[1082,813],[227,814]]},{"text":"the CR has mainly focused on either political power struggles among top leaders in","box":[[225,845],[1056,846],[1056,874],[225,873]]},{"text":"Beijing, or the student movements (existing studies are mainly on Red Guards in","box":[[226,902],[1032,901],[1032,928],[226,929]]},{"text":"Beijing, Guangzhou and Wuhan).Different from these studies, my project focuses on","box":[[226,959],[1072,961],[1072,988],[226,986]]},{"text":"the workers’ movement and the role of mass political participation in the shaping and","box":[[225,1016],[1078,1017],[1078,1045],[225,1044]]},{"text":"formation of the Shanghai Commune. I will explore the political activism of leaders","box":[[225,1076],[1065,1075],[1065,1103],[225,1104]]},{"text":"of mass organizations as well as of ordinary workers and citizens, many of whom in","box":[[225,1131],[1064,1133],[1064,1160],[225,1158]]},{"text":"fact held different political viewpoints while declaring allegiance to the same banner","box":[[226,1192],[1071,1192],[1071,1219],[226,1219]]},{"text":"ofMaoZedongThought","box":[[226,1246],[473,1249],[473,1276],[226,1274]]},{"text":"The short-lived Shanghai Commune lasted only 20 days, and was then","box":[[300,1322],[1003,1323],[1003,1350],[300,1349]]},{"text":"replaced by a Three-in-One Combination leadership. Yet for several important","box":[[227,1390],[1005,1390],[1005,1414],[227,1414]]},{"text":"thinkers such as Alain Badiou and Slavoj Zizek, and some scholars such as Henry C.","box":[[225,1451],[1069,1452],[1069,1479],[225,1478]]},{"text":"4","box":[[651,1633],[664,1633],[664,1650],[651,1650]]}],"dimensions":{"height":1755,"width":1241}}