{"ocr_results":[{"text":"be systemized and institutionalized. On the contrary, in order to criticize the trend of","box":[[225,174],[1070,172],[1070,196],[225,197]]},{"text":"paying too much attention to “material benefits\" and “material incentives” at that time,","box":[[225,240],[1094,237],[1094,261],[225,264]]},{"text":"Zhang cited Marx's approval of theParis Commune in TheCivil War inFrance,","box":[[227,304],[1024,304],[1024,328],[227,328]]},{"text":"“From the members of the Commune downwards, the public service had to be done at","box":[[227,365],[1087,368],[1087,395],[227,392]]},{"text":"workmen's wages. The vested interests and the representation allowances of the high","box":[[229,434],[1072,434],[1072,458],[229,458]]},{"text":"dignitaries of State disappeared along with the high dignitaries themselves.\"38 Zhang","box":[[224,495],[1080,495],[1080,527],[224,527]]},{"text":"hence regarded the adoption by the Paris Commune of the revolutionary measures that","box":[[227,563],[1088,563],[1088,587],[227,587]]},{"text":"focusedless onmaterial interests as part of the efforts to thoroughly demolish the","box":[[226,628],[1037,629],[1037,653],[226,652]]},{"text":"hierarchical system of bourgeois rights. Zhang went even further to argue that there","box":[[225,693],[1059,692],[1059,719],[225,720]]},{"text":"was a need to strengthen communist education from political and ethical perspectives","box":[[226,760],[1078,760],[1078,784],[226,784]]},{"text":"so as to struggle for the complete eradication of bourgeois rights. In that regard, he","box":[[225,825],[1049,824],[1049,848],[225,849]]},{"text":"favored a free supply system (gongji zhi), where pay were handed out according to","box":[[227,889],[1052,889],[1052,913],[227,913]]},{"text":"needs rather than a hierarchical wage system. That is, Zhang Chunqiao basically","box":[[225,953],[1023,955],[1023,979],[225,977]]},{"text":"treated the Paris Commune as a model with the communistic virtue of abolishing","box":[[224,1015],[1034,1018],[1034,1045],[224,1042]]},{"text":"hierarchy and bourgeois rights. This viewforeshadowedwhat really took place in the","box":[[227,1085],[1075,1085],[1075,1108],[227,1108]]},{"text":"CR, within which Zhang Chunqiao himself played a major part in trying to build a","box":[[225,1147],[1048,1148],[1048,1175],[225,1174]]},{"text":"newcommune inShanghai.","box":[[223,1216],[500,1211],[500,1239],[223,1244]]},{"text":"In discussing whether or not to publish Zhang's article in the People's Daily.","box":[[298,1277],[1063,1278],[1063,1305],[298,1304]]},{"text":"the chief-editor Wu Lengxi gathered many opposing opinions. Wu himself could not","box":[[226,1343],[1070,1343],[1070,1370],[226,1370]]},{"text":"make the decision and submitted the article to Mao. In a letter responding to Wu","box":[[226,1410],[1023,1410],[1023,1434],[226,1434]]},{"text":"Lengxi, Mao praised Zhang's article as \"basically correct\", with the only shortcoming","box":[[224,1473],[1083,1475],[1083,1502],[224,1500]]},{"text":"38 The English translation is from The Civil War in France, Foreign Languages Press, Beijing, 1964, p. 70,","box":[[219,1552],[1030,1560],[1030,1594],[219,1586]]},{"text":"emphasisoriginal.","box":[[227,1586],[361,1586],[361,1606],[227,1606]]},{"text":"191","box":[[643,1631],[672,1631],[672,1652],[643,1652]]}],"dimensions":{"height":1755,"width":1241}}