{"ocr_results":[{"text":"differences between theShanghai Commune and theShanghai Revolutionary","box":[[226,172],[994,176],[994,199],[226,196]]},{"text":"Committee. During the period of forming RCs throughout China, there was strong","box":[[226,239],[1046,240],[1046,264],[226,263]]},{"text":"opposition from the ultra-leftist Red Guards, represented by Yang Xiaokai, to the","box":[[228,305],[1031,305],[1031,329],[228,329]]},{"text":"replacement of the Shanghai Commune. These forces, who hated the Revolutionary","box":[[224,366],[1061,367],[1061,397],[224,396]]},{"text":"Committees favored by Mao, envisioned a People's Commune of China. It is tempting","box":[[227,432],[1089,434],[1089,461],[227,459]]},{"text":"to discuss their position. But given the limitations of this disseration, I will leave the","box":[[225,500],[1066,499],[1066,523],[225,524]]},{"text":"ultra-leftists'roadmap to a communal statefor later exploration.","box":[[227,563],[862,564],[862,588],[227,587]]},{"text":"In the Conclusion,I reaffirm that the Chinese Commune movement in 1967 was","box":[[270,629],[1074,629],[1074,652],[270,652]]},{"text":"an unprecedented and far-reaching revolution that changed the face of China, not a","box":[[224,692],[1054,693],[1054,720],[224,719]]},{"text":"farce as some people have depicted. I also outline the fate of the major players in the","box":[[226,758],[1069,759],[1069,783],[226,782]]},{"text":"Shanghai Commune after the coup d'état in 1976. More attention is given to the issue","box":[[228,825],[1079,825],[1079,849],[228,849]]},{"text":"of how to prevent a socialist society from capitalist restoration and whether there is a","box":[[225,886],[1076,887],[1076,914],[225,913]]},{"text":"future for the Paris Commune in China. If there exists a possibility for the revival of","box":[[224,951],[1067,952],[1067,979],[224,978]]},{"text":"the commune spirit/ model in China, what should the revolutionaries learn from the","box":[[227,1019],[1058,1019],[1058,1043],[227,1043]]},{"text":"lessons of the Paris Commune and the Shanghai Commune? Following this vein, I","box":[[225,1081],[1048,1083],[1048,1110],[225,1108]]},{"text":"discuss a possible Maoist roadmap to extensive democracy within the philosophical","box":[[226,1148],[1061,1148],[1061,1175],[226,1175]]},{"text":"framework of the dialectics of party and mass organizations. Having drawn the","box":[[224,1211],[1014,1214],[1014,1241],[224,1237]]},{"text":"lessons of the Shanghai Commune and the CR, I propose a tentative model: the mass","box":[[227,1279],[1073,1279],[1073,1303],[227,1303]]},{"text":"organizations, instead of being weakened, should be consolidated as necessary","box":[[226,1343],[1007,1343],[1007,1370],[226,1370]]},{"text":"complements to the party, while the two should maintain a dialectical relationship","box":[[227,1410],[1043,1410],[1043,1434],[227,1434]]},{"text":"That is to say, the pro-communist mass organizations are politically, not","box":[[225,1473],[943,1474],[943,1501],[225,1500]]},{"text":"organizationally, under the leadership of the revolutionary party, yet maintain their","box":[[225,1539],[1050,1538],[1050,1565],[225,1566]]},{"text":"12","box":[[647,1630],[669,1630],[669,1653],[647,1653]]}],"dimensions":{"height":1755,"width":1241}}