{"ocr_results":[{"text":"Amid the storm of the Red Guard movement, the majority of the rank-and-file","box":[[300,172],[1079,174],[1079,197],[300,196]]},{"text":"workers werenotfully involved in thefirst wave of theCR.But alongwithsix other","box":[[227,239],[1070,239],[1070,262],[227,262]]},{"text":"workers, Wang Hongwen, who later became one of the key rebel leaders in Shanghai","box":[[227,305],[1075,305],[1075,329],[227,329]]},{"text":"grasping the historical significance of Mao's earnest call for a new revolution,were","box":[[226,371],[1059,366],[1059,390],[226,395]]},{"text":"among the first to be fully involved in the Cultural Revolution. Wang, a veteran of the","box":[[227,435],[1075,435],[1075,459],[227,459]]},{"text":"Korean War, had been working at the Shanghai's No. 17 Textile Mill for ten years.","box":[[224,497],[1046,499],[1046,526],[224,523]]},{"text":"first as a maintenance worker (baoquangong) and then as the factory's security chief.","box":[[224,561],[1074,562],[1074,589],[224,588]]},{"text":"On June 12, 1966, inspired by Nie Yuanzi and her colleagues' wall poster, the 7 rebels","box":[[227,630],[1083,630],[1083,654],[227,654]]},{"text":"at No. 17 Textile Mill put up a big-character poster entitled “See through the","box":[[224,693],[987,692],[987,719],[224,720]]},{"text":"Make-ups of the Party Branch to Get the Truth Out\" in the factory. Putting out the","box":[[227,760],[1041,760],[1041,784],[227,784]]},{"text":"slogan of \"bringing down the bourgeois authorities, uprooting the deep-rooted old","box":[[224,821],[1045,822],[1045,852],[224,851]]},{"text":"revisionism!\" in this poster, Wang and his comrades accused Zhang Heming, the","box":[[225,888],[1028,889],[1028,913],[225,912]]},{"text":"vice-secretary of the factory's party branch', of “revisionism,” offering a good deal of","box":[[226,952],[1083,952],[1083,979],[226,979]]},{"text":"evidence to question the old party committee: “why do you avoid class struggle like","box":[[226,1018],[1063,1018],[1063,1045],[226,1045]]},{"text":"the plague? Doesn't your revisionist line of cadres intend topave the way for","box":[[227,1084],[994,1084],[994,1108],[227,1108]]},{"text":"capitalism?Where do you want to lead our whole factory with eight thousand","box":[[229,1150],[1001,1150],[1001,1174],[229,1174]]},{"text":"workers?\" Like a heavy bomb that broke through the once murky silence, this","box":[[227,1215],[1001,1215],[1001,1238],[227,1238]]},{"text":"big-character poster hit right at the heart of the party committee. Zhang Heming and","box":[[226,1278],[1066,1277],[1066,1304],[226,1305]]},{"text":"his men were so scared that they hurried to lay siege to Wang Hongwen and his","box":[[224,1341],[1018,1342],[1018,1370],[224,1369]]},{"text":"comrades trying to divide and demoralize them, following and spying on them. Using","box":[[226,1408],[1079,1412],[1079,1436],[226,1432]]},{"text":"all of their resources and power, they tried their best to stamp out the flames kindled","box":[[225,1472],[1066,1473],[1066,1500],[225,1499]]},{"text":"3 Shanghai No. 17 Textile Millhad no party secretary at that time, and the vice-secretary Zhang Heming was the","box":[[222,1556],[1073,1561],[1073,1592],[222,1586]]},{"text":"topleader at thefactory.","box":[[224,1582],[408,1586],[407,1610],[224,1606]]},{"text":"242","box":[[642,1631],[672,1631],[672,1652],[642,1652]]}],"dimensions":{"height":1755,"width":1241}}