{"ocr_results":[{"text":"Helped and prompted by Zhang Chunqiao andYaoWenyuan, both members of the","box":[[227,175],[1050,175],[1050,198],[227,198]]},{"text":"CCRG, the Writers' Group of the Shanghai Municipal Committee announced its","box":[[225,237],[1022,236],[1022,263],[225,264]]},{"text":"“collective rebellion\" and its independence from the Shanghai Party. Viewed as “a","box":[[226,300],[1046,303],[1046,331],[226,328]]},{"text":"bombshell exploded in the backyard of the Cao (Diqiu) family” at that time, this dealt","box":[[227,370],[1082,370],[1082,394],[227,394]]},{"text":"a heavy blow to the Shanghai authorities because theWriters' Group had functionec","box":[[227,435],[1062,435],[1062,459],[227,459]]},{"text":"as the insider source of information for the Shanghai Party. On Dec. 18, the","box":[[224,497],[977,500],[976,526],[224,522]]},{"text":"Revolutionary Rebel Liaison Centre of Organizations of the Shanghai Municipal","box":[[226,563],[1031,563],[1031,590],[226,590]]},{"text":"Party Committee (jilianzhan for short), with the Writers' Group as its core, convened","box":[[224,627],[1074,628],[1074,655],[224,654]]},{"text":"a big rally to “hold high the red flag of Mao Zedong's thought and strafe the","box":[[224,692],[984,694],[984,721],[224,719]]},{"text":"bourgeois reactionary line of the old Municipal Committee\", at which Mayor Cao and","box":[[224,757],[1084,758],[1084,785],[224,784]]},{"text":"his senior Chen Pixian, the first secretary of SPC were forced to stand on a table,","box":[[224,822],[1033,823],[1033,850],[224,849]]},{"text":"lowering their heads to make public self-criticism. Obviously, the tide was running","box":[[227,889],[1051,889],[1051,913],[227,913]]},{"text":"against the old Shanghai Municipal Committee and the Scarlet Guards they supported.","box":[[226,953],[1088,951],[1088,978],[226,980]]},{"text":"Out of a strong will for political survival, cadres at all levels of the Shanghai","box":[[300,1018],[1064,1016],[1064,1043],[300,1045]]},{"text":"Party acted rapidly and efficiently. They used all the resources that were available to","box":[[226,1084],[1068,1084],[1068,1108],[226,1108]]},{"text":"check the movement, among which the most handy and effective tool was money,","box":[[225,1147],[1041,1148],[1041,1175],[225,1174]]},{"text":"since the economic system,such as banks and treasury departments at all units","box":[[227,1215],[1011,1215],[1011,1238],[227,1238]]},{"text":"remained intact, and seals for authorizing money distribution were still under their","box":[[226,1279],[1047,1279],[1047,1303],[226,1303]]},{"text":"control. The role of the bureaucrats in creating a so-called “wind of economism'","box":[[226,1343],[1024,1343],[1024,1370],[226,1370]]},{"text":"blowing in the last days of 1966 and the first days of 1967 would be decisive. For the","box":[[225,1407],[1076,1408],[1076,1435],[225,1434]]},{"text":"Shanghai authorities, on the one hand, they could use money to buy off workers fo1","box":[[227,1475],[1055,1475],[1055,1499],[227,1499]]},{"text":"exchanging political support, or, at least, compromises. A money deluge, on the other","box":[[227,1541],[1074,1541],[1074,1565],[227,1565]]},{"text":"273","box":[[641,1631],[672,1631],[672,1652],[641,1652]]}],"dimensions":{"height":1755,"width":1241}}