{"ocr_results":[{"text":"more Scarlet Guards outside theHengshanHotel. Low-intensity conflicts of violence","box":[[226,173],[1075,175],[1075,198],[226,197]]},{"text":"erupted across the city. Upon learning of the Kangping incident, Ma Tianshui, a","box":[[225,237],[1022,238],[1022,265],[225,264]]},{"text":"secretary of the SPC, informed Zhang Chunqiao in Beijing via phone of the rumored","box":[[225,303],[1072,302],[1072,329],[225,330]]},{"text":"house-searching of his residence by the Scarlet Guards and their threat to shut down","box":[[224,367],[1066,368],[1066,395],[224,394]]},{"text":"the whole city.°° Possibly encouraged by Zhang Chunqiao, the WGH immediately","box":[[225,432],[1048,433],[1048,460],[225,459]]},{"text":"sent out contingents of propaganda teams and loudspeaker vans to launch a political","box":[[225,499],[1061,499],[1061,526],[225,526]]},{"text":"offensive and debate with the Scarlet Guards, though still outnumbered by their","box":[[225,561],[1019,562],[1019,590],[225,589]]},{"text":"adversaries. But the situation changed dramatically when 200,000 rebels led by Geng","box":[[225,626],[1077,629],[1077,656],[225,653]]},{"text":"Jinzhang, the obstinate and unruly commander of the Second Corps of the WGH","box":[[224,692],[1030,693],[1030,720],[224,719]]},{"text":"arrived at Kangping Street - since Geng's rebels did not hestitate to use force. Under","box":[[226,759],[1072,759],[1072,786],[226,786]]},{"text":"attacks from 200,000 rebels, the Scarlet Guards were utterly and quickly disheartened","box":[[227,825],[1081,825],[1081,849],[227,849]]},{"text":"since most of them were merely motivated by cadres within a short time thus had","box":[[226,888],[1036,888],[1036,912],[226,912]]},{"text":"neither a strong fighting will nor battle experiences like the rebels had in Anting","box":[[226,953],[1026,955],[1026,979],[226,977]]},{"text":"Moreover, severely castigated by rebels and common citizens, the rumored","box":[[226,1019],[975,1019],[975,1043],[226,1043]]},{"text":"unreasonable yet fruitless house-search in Zhang Chunqiao's residence in fact led to","box":[[226,1084],[1064,1083],[1064,1107],[226,1108]]},{"text":"their own demoralization.When ferocious rebels descended on the Scarlet Guards","box":[[225,1147],[1044,1148],[1044,1172],[225,1171]]},{"text":"swinging punches, understandably, many of them took off their arm bands and","box":[[224,1213],[1008,1212],[1008,1239],[224,1240]]},{"text":"escaped the battle field. The gigantic loyalist workers’ organization in Shanghai","box":[[225,1277],[1020,1278],[1020,1305],[225,1304]]},{"text":"collapsed due to this battle. After that, there were no major loyalist organizations","box":[[225,1342],[1032,1344],[1032,1371],[225,1369]]},{"text":"defending the SPC and challenging the rebel forces. Furthermore, the SPC could not","box":[[226,1408],[1070,1407],[1070,1434],[226,1435]]},{"text":"resort to the PLA for support either because the Shanghai garrison, in keeping with","box":[[226,1476],[1051,1476],[1051,1500],[226,1500]]},{"text":"66 Wang Nianyi, Da dongluan de niandai (Years of Great Turmoil), Zhengzhou: He'nan renmin chubanshe, 1988,.","box":[[218,1553],[1082,1558],[1082,1595],[218,1589]]},{"text":"p.169.","box":[[225,1586],[271,1586],[271,1605],[225,1605]]},{"text":"287","box":[[642,1631],[672,1631],[672,1652],[642,1652]]}],"dimensions":{"height":1755,"width":1241}}