{"ocr_results":[{"text":"some Chinese cadres,even if the current cadre team was generally good. The ultimate","box":[[226,172],[1082,175],[1082,198],[226,196]]},{"text":"aim of the CR was not to bring down many cadres, but to train capable revolutionary","box":[[225,237],[1069,240],[1069,264],[225,261]]},{"text":"successors, including those cadres who were willing to continue the revolution, and to","box":[[225,304],[1085,303],[1085,327],[225,328]]},{"text":"educate the masses in how to combat revisionism, especially after the old veteran","box":[[225,367],[1038,369],[1038,396],[225,394]]},{"text":"revolutionaries passed away. Therefore, Mao himself preferred to call the CR a","box":[[225,435],[1015,434],[1015,458],[225,459]]},{"text":"rehearsal for possible future revolutions if the capitalist system was restored in China","box":[[227,500],[1079,500],[1079,524],[227,524]]},{"text":"To prepare for such revolutions in the future, it was necessary to organize millions","box":[[225,561],[1047,564],[1047,591],[225,588]]},{"text":"upon millions of masses and move a mighty revolutionary army into action right away.","box":[[226,629],[1094,630],[1094,654],[226,653]]},{"text":"Only a force of such magnitude could crush the revisionists who controlled a major","box":[[225,692],[1058,693],[1058,720],[225,719]]},{"text":"portion of the state power. In this kind of rehearsal, the masses would get tempered","box":[[224,759],[1055,757],[1055,784],[224,786]]},{"text":"and grow into capable successors for the revolution. That was why the Maoist leaders","box":[[227,825],[1079,825],[1079,849],[227,849]]},{"text":"had to restort to such large-scale revolutionary methods even though the cadre teams","box":[[225,887],[1070,889],[1070,913],[225,911]]},{"text":"were considered generally good. This seeming paradox is what confused Alain Badiou.","box":[[227,954],[1093,954],[1093,978],[227,978]]},{"text":"But once the masses were widely mobilized, the revolutionary momentum could crush","box":[[225,1017],[1090,1020],[1090,1044],[225,1041]]},{"text":"all plans, no matter who had set the agendas. In Shanghai, thanks to the general strike","box":[[227,1083],[1078,1084],[1078,1108],[227,1107]]},{"text":"by the Scarlet Guards and cadres, the original plan to seize power from a handful of","box":[[225,1148],[1064,1147],[1064,1174],[225,1175]]},{"text":"“capitalist roaders” set by the Maoist leaders became a full-scale mass take-over from","box":[[229,1212],[1081,1212],[1081,1238],[229,1238]]},{"text":"almost all thepower holders. TheMaoist leadership inBeijing had toface and","box":[[229,1280],[1006,1280],[1006,1303],[229,1303]]},{"text":"acknowledgethenewpoliticallandscape","box":[[228,1344],[635,1346],[635,1370],[228,1368]]},{"text":"January 6 saw heavy snow. In the morning more than 10o,000 rebels attended","box":[[301,1409],[1075,1409],[1075,1433],[301,1433]]},{"text":"a huge rally in People's Plaza which was called \"Raising High the Great Banner of","box":[[226,1474],[1053,1475],[1053,1499],[226,1498]]},{"text":"Mao Zedong's Thought, Thoroughly Bringing Down the SPC Headed by Chen and","box":[[227,1540],[1053,1540],[1053,1564],[227,1564]]},{"text":"316","box":[[641,1631],[672,1631],[672,1652],[641,1652]]}],"dimensions":{"height":1755,"width":1241}}