{"ocr_results":[{"text":"raid.","box":[[221,173],[269,170],[271,197],[223,200]]},{"text":"OnJanuary 24, when the rebelWenhui Daily requested that each major rebel","box":[[302,239],[1065,239],[1065,263],[302,263]]},{"text":"organization submit one article to praise the proposed Shanghai People's Commune.","box":[[227,305],[1065,305],[1065,329],[227,329]]},{"text":"Geng Jinzhang said that the Second Corps was not willing to write such an article.","box":[[225,367],[1044,368],[1044,395],[225,394]]},{"text":"Instead, they opposed the Shanghai Commune as it stood. On January 26, infuriated","box":[[226,434],[1064,434],[1064,461],[226,461]]},{"text":"by the alleged persecution of his men by the WGH, the boisterous Geng Jinzhang led","box":[[224,499],[1075,498],[1075,524],[224,526]]},{"text":"all of his 14 friendly rebel factions to burst into a meeting that was preparing for the","box":[[226,562],[1063,563],[1063,590],[226,589]]},{"text":"formation of the Shanghai Commune. Geng wrangled with Wang Hongwen and other","box":[[226,629],[1079,629],[1079,656],[226,656]]},{"text":"representatives, face to face, causing the preparatory meeting to take a recess. Later,","box":[[226,695],[1064,695],[1064,719],[226,719]]},{"text":"Geng openly declared that this meeting was meant to discredit his Second Corps, so","box":[[225,757],[1063,758],[1063,785],[225,784]]},{"text":"he set out to totally wreck it. But the most important reason underlying Geng Jinzhang","box":[[224,823],[1089,824],[1089,851],[224,850]]},{"text":"and his factions'ruining the preparatory meetings for the proposed Commune was","box":[[226,888],[1047,889],[1047,913],[226,912]]},{"text":"that they believed that they were stronger than theWGH-led political forces. That was","box":[[226,953],[1086,954],[1086,978],[226,977]]},{"text":"indeed partly true, since almost all the anti-WGH forces had congregated around","box":[[226,1018],[1030,1019],[1030,1043],[226,1042]]},{"text":"Geng Jinzhang and might have outnumbered the WGH-led forces. In the view of","box":[[227,1084],[1034,1084],[1034,1108],[227,1108]]},{"text":"Geng Jinzhang and his men, the Second Corps, rather than the WGH, should be the","box":[[226,1148],[1057,1150],[1057,1174],[226,1172]]},{"text":"organizationtolead thenewpower organ,or atleasthold thebiggestshareofpower","box":[[226,1214],[1068,1215],[1068,1238],[226,1237]]},{"text":"in the new government. But obviously, in the view of the WGH and Zhang Chunqiao","box":[[225,1278],[1077,1280],[1077,1304],[225,1302]]},{"text":"the Second Corps was just a subsidiary faction of the WGH; to realize the broadest","box":[[227,1343],[1054,1342],[1054,1369],[227,1370]]},{"text":"unity, it was better for the Second Corps to be integrated into its parent organization","box":[[226,1408],[1064,1409],[1064,1436],[226,1435]]},{"text":"Since the WGH-led forces could not satisfy Geng's groups, Geng and his factions","box":[[225,1473],[1042,1474],[1042,1501],[225,1500]]},{"text":"carried out their own plan, that is, they organized their own preparatory meetings as","box":[[227,1541],[1061,1541],[1061,1565],[227,1565]]},{"text":"382","box":[[642,1631],[672,1631],[672,1652],[642,1652]]}],"dimensions":{"height":1755,"width":1241}}