{"ocr_results":[{"text":"\"January Revolution\" is now sweeping the whole country.92","box":[[298,152],[901,143],[902,187],[299,196]]},{"text":"In the editorial, some aspects and characteristics of the power seizure were","box":[[299,231],[1046,232],[1046,256],[299,255]]},{"text":"emphasized: First, to form a great alliance and seize power from the handful of","box":[[225,294],[1017,295],[1017,322],[225,321]]},{"text":"capitalist roaders was the general orientation at the current time. Secondly, the most","box":[[225,360],[1062,361],[1062,388],[225,387]]},{"text":"important condition that would secure the success of the power seizure was to build","box":[[226,427],[1060,427],[1060,451],[226,451]]},{"text":"the great alliance of the proletarian revolutionaries and unite the broad masses. In","box":[[226,492],[1038,492],[1038,516],[226,516]]},{"text":"order to achieve that,it was necessary to rectify such erroneous tendencies as","box":[[226,555],[996,556],[996,580],[226,579]]},{"text":"departmentalism, \"small group\" mentality (prioritizing the interests of a particular","box":[[226,621],[1042,621],[1042,648],[226,648]]},{"text":"group over general interests), excessive decentralization, disregard for organizational","box":[[224,685],[1075,682],[1075,712],[224,715]]},{"text":"discipline, ultra-democracy, liberalism, and subjectivism and individualism in people's","box":[[227,752],[1087,752],[1087,776],[227,776]]},{"text":"minds and in their organizations. Thirdly, since the overwhelming majority of","box":[[227,818],[1001,818],[1001,842],[227,842]]},{"text":"ordinary cadres were good and willing to make revolution, adequate attention had to","box":[[226,881],[1068,881],[1068,908],[226,908]]},{"text":"be paid to the role of revolutionary cadres in the struggle to seize power. Fourthly","box":[[224,945],[1043,946],[1043,973],[224,972]]},{"text":"reactionaries such as the bourgeoisie and its handful of agents within the Party would","box":[[224,1011],[1077,1011],[1077,1038],[224,1038]]},{"text":"not be given either extensive democracy or limited democracy; only dictatorship","box":[[224,1075],[1030,1077],[1030,1104],[224,1102]]},{"text":"would be applied to such people. Moreover, this editorial made it crystal clear that the","box":[[227,1143],[1083,1143],[1083,1167],[227,1167]]},{"text":"currentseizure of power wasnot effectedby dismissals or reorganizationsfrom above,","box":[[227,1208],[1095,1208],[1095,1231],[227,1231]]},{"text":"but by the mass-initiated movement from the bottom up that was called for and","box":[[224,1269],[1016,1270],[1016,1297],[224,1296]]},{"text":"supported by Chairman Mao. Only in this way could the state apparatus be","box":[[225,1335],[973,1336],[972,1363],[225,1362]]},{"text":"regenerated and the old bourgeois practices thoroughly eradicated. In this regard, the","box":[[225,1401],[1071,1401],[1071,1428],[225,1428]]},{"text":"mass-initiated Chinesepractices reaffirmed the principles of theParis Commune","box":[[226,1468],[1029,1468],[1029,1491],[226,1491]]},{"text":"92 See“On the Proletarian Revolutionaries Struggle to Seize Power’(Lun wuchan jieji geming pai de duoquan","box":[[222,1533],[1064,1538],[1064,1569],[222,1563]]},{"text":"douzheng),from People's Daily, Jan. 31,1967,the English translation can be found at Peking Review,No.6,","box":[[224,1562],[1042,1563],[1042,1586],[224,1585]]},{"text":"February3,1967.","box":[[226,1585],[359,1585],[359,1605],[226,1605]]},{"text":"389","box":[[642,1631],[672,1631],[672,1651],[642,1651]]}],"dimensions":{"height":1755,"width":1241}}