{"ocr_results":[{"text":"The government then dispatched forces and fought them back.\"3 On October 18,","box":[[224,171],[1036,170],[1036,199],[224,200]]},{"text":"when five thousand Prussian troops arrived at the Stone Cave Village*, the villagers","box":[[227,238],[1057,238],[1057,262],[227,262]]},{"text":"rose to fight and injured more than 1,80o Prussians. In retaliation, the enemy fired","box":[[226,304],[1044,303],[1044,327],[226,328]]},{"text":"cannons, destroying all the village buildings and wounding several hundreds of","box":[[224,368],[1018,367],[1018,394],[224,395]]},{"text":"villagers.After this battle, the French government honored the villagers with a great","box":[[227,433],[1063,435],[1063,459],[227,457]]},{"text":"deal of money. At this critical moment, Paris' citizens donated 500 cannons by saving","box":[[225,498],[1079,499],[1079,526],[225,524]]},{"text":"on food and family expense. Meanwhile, all the copper and iron utensils in the","box":[[226,564],[1008,563],[1008,587],[226,588]]},{"text":"churches were collected to cast cannons. On October 31, when the Government of","box":[[227,628],[1047,628],[1047,652],[227,652]]},{"text":"National Defense started negotiations with the Prussians to try to reach a truce,","box":[[223,691],[1013,694],[1013,722],[223,719]]},{"text":"thousands of \"hongtou\"(national guards) surrounded the city hall and proclaimed the","box":[[227,760],[1077,760],[1077,784],[227,784]]},{"text":"formation of a Commune (hongtou minzheng), but this quickly failed.? On January 7,","box":[[224,822],[1083,822],[1083,852],[224,852]]},{"text":"1871, before the official signing of the armistice treaty, some rebel “hongtou","box":[[226,886],[998,887],[998,915],[226,914]]},{"text":"demonstrated in the streets of Paris. One street security guard who tried to stop them","box":[[226,952],[1068,954],[1068,978],[226,976]]},{"text":"was tied to a wood board and thrown into a river. In sharp contrast to the patriotism of","box":[[226,1018],[1087,1019],[1087,1043],[226,1042]]},{"text":"the Parisian people, the ruling class of France showed that they did not care about the","box":[[226,1083],[1077,1084],[1077,1108],[226,1107]]},{"text":"future of the state. Zhang Deyi reported that an army officer paid a visit to him in","box":[[224,1147],[1037,1148],[1037,1175],[224,1174]]},{"text":"Marseilles.This officer was supposed topurchaseshoes andsocksfor thetroops,yet","box":[[225,1213],[1072,1215],[1072,1238],[225,1236]]},{"text":"to Zhang's surprise, he was busy with walking around and watching plays, not tending","box":[[226,1278],[1087,1280],[1087,1304],[226,1302]]},{"text":"to his government assignments. Further, “\"when Paris had been under siege [by the","box":[[224,1342],[1044,1343],[1044,1370],[224,1369]]},{"text":"Prussian army] and the emperor was captured, the streets and markets of Marseilles","box":[[224,1408],[1059,1407],[1059,1434],[224,1435]]},{"text":"3 Ibid. p.93. “Red heads\" (hongtou) was a derogatory term for the Chinese rebel peasants in Qing dynasty. Here","box":[[220,1491],[1067,1495],[1067,1526],[220,1522]]},{"text":"Zhang Deyi appropriated it to call the national guards and the ensuing communards in Paris as they carried red","box":[[222,1517],[1056,1519],[1056,1546],[222,1544]]},{"text":"flags.","box":[[225,1540],[266,1544],[264,1564],[223,1560]]},{"text":"4 The placename is literally translated from Shitoudong cun in Zhang Deyi's journal. I am not sure where it is.","box":[[221,1558],[1054,1562],[1054,1590],[221,1585]]},{"text":"5Ibid.pp.93-95.","box":[[221,1579],[352,1586],[351,1611],[219,1604]]},{"text":"30","box":[[647,1632],[668,1632],[668,1651],[647,1651]]}],"dimensions":{"height":1755,"width":1241}}