{"ocr_results":[{"text":"Wenyuan, the quarrel between the supporters and opponents of the CR intensified.","box":[[226,173],[1046,172],[1046,198],[226,199]]},{"text":"This new round of struggle, more or less, began with the issue of Chen Pixian, the","box":[[224,236],[1045,237],[1045,264],[224,263]]},{"text":"first secretary of the SPC and the target of struggle among Shanghai rebels. Since the","box":[[224,302],[1075,303],[1075,331],[224,330]]},{"text":"major high Party cadres in the country, apart from those in the Army and some in the","box":[[227,370],[1070,370],[1070,394],[227,394]]},{"text":"Central organs of Beijing, had endured hard struggles from the rebels, a lot of","box":[[225,432],[1002,433],[1002,460],[225,459]]},{"text":"discontent about the CR among the old revolutionaries came bursting out. Some high","box":[[225,497],[1075,499],[1075,526],[225,523]]},{"text":"Party cadres in Beijing such as Tao Zhu, Chen Yi and Zhou Enlai, who had personal","box":[[225,563],[1064,563],[1064,590],[225,590]]},{"text":"access to Mao, suggested that selected cadres be protected from the masses' struggle.","box":[[224,628],[1072,627],[1072,654],[224,655]]},{"text":"As a result, Mao agreed to fly those cadres on the suggested list—Chen Pixian","box":[[227,695],[1008,695],[1008,719],[227,719]]},{"text":"included—to Beijing for protection. But when the airplane supposedly flying Chen","box":[[227,760],[1053,760],[1053,784],[227,784]]},{"text":"Pixian to Beijing arrived in Shanghai on Jan. 28 amid the January Storm, nobody","box":[[226,824],[1032,825],[1032,849],[226,848]]},{"text":"handed Chen to the crew members of that plane. Consequently, Chen did not show up","box":[[225,887],[1082,890],[1082,914],[225,911]]},{"text":"in Beijing as planned. Why was that? Chen Pixian himself, after his rehabilitation","box":[[227,954],[1039,954],[1039,978],[227,978]]},{"text":"later, blamed this aborted trip on deliberate sabotage by Zhang Chunqiao and Wang","box":[[224,1016],[1058,1019],[1058,1046],[224,1043]]},{"text":"Hongwen. Yet in the same memoir, Chen unintentionally disclosed some clues about","box":[[226,1084],[1071,1084],[1071,1108],[226,1108]]},{"text":"what really happened to him. According to his recollection, from the middle of","box":[[226,1148],[1013,1148],[1013,1175],[226,1175]]},{"text":"January to February 25, Chen Pixian was held in protective custody by Geng","box":[[224,1211],[991,1215],[991,1242],[224,1237]]},{"text":"Jinzhang's defiant Second Corps, which was fighting a tough war with Wang","box":[[225,1277],[993,1279],[993,1306],[225,1304]]},{"text":"Hongwen and Zhang Chunqiao's WGH at that time.\"° The failure to pick up Chen","box":[[226,1343],[1048,1343],[1048,1370],[226,1370]]},{"text":"Pixian from Shanghai, however, enraged vice Premier Tan Zhenlin, who was a fellow","box":[[224,1407],[1080,1407],[1080,1437],[224,1437]]},{"text":"commander of Chen's during anti-Japanese war and senior and had been superior tc","box":[[226,1475],[1060,1475],[1060,1499],[226,1499]]},{"text":"26 See Chen Pixian, 2005, pp.168-174.","box":[[222,1575],[519,1582],[519,1613],[222,1606]]},{"text":"437","box":[[640,1629],[673,1629],[673,1653],[640,1653]]}],"dimensions":{"height":1755,"width":1241}}