{"ocr_results":[{"text":"and stereotype descriptions of plots and counterplots, sieges, and skirmishes\",84 in the","box":[[223,172],[1091,166],[1091,199],[223,204]]},{"text":"snowy afternoon of February 24, a huge oath-taking rally with more than ten thousand","box":[[227,239],[1087,239],[1087,263],[227,263]]},{"text":"people, titled “Raise the Great Red Flag of Mao Zedong Thought and Take Further","box":[[227,304],[1051,304],[1051,328],[227,328]]},{"text":"Steps to Seize Power in the Three-in-One Combination', was held at Cultural Plaza of","box":[[225,366],[1090,367],[1090,394],[225,393]]},{"text":"Shanghai. Presided over by Yao Wenyuan and televised all over the city, this rally set","box":[[228,435],[1075,435],[1075,459],[228,459]]},{"text":"as one of its main tasks explaining to the Shanghai rebels the reasons for the name","box":[[225,498],[1046,498],[1046,525],[225,525]]},{"text":"change of the Shanghai Commune. With a good sense of confidence and humor, and","box":[[225,562],[1069,561],[1069,588],[225,589]]},{"text":"using his capacity to explain profound things in simple terms, Zhang Chunqiac","box":[[226,629],[1011,629],[1011,656],[226,656]]},{"text":"dynanmically communicated Mao's instructions about the CR in Shanghai to the","box":[[226,693],[1030,693],[1030,720],[226,720]]},{"text":"enthusiastic audience. While detailing Mao's recent directives, Zhang succintly","box":[[225,757],[1015,758],[1015,785],[225,784]]},{"text":"summed up the main gist of Mao's talks: why it was necessary to make the CR under","box":[[227,825],[1075,825],[1075,849],[227,849]]},{"text":"the proletarian dictatorship; that carrying out the CR necessitated a great alliance; and","box":[[225,886],[1083,887],[1083,914],[225,913]]},{"text":"that the best way to reach a great alliance was through the three-in-one combination","box":[[227,954],[1065,954],[1065,978],[227,978]]},{"text":"To win over the audience, Zhang mentioned that there were many failed cases of","box":[[224,1016],[1032,1017],[1032,1044],[224,1043]]},{"text":"power seizures due to factional fights and the lack of a great alliance. For instance, a","box":[[226,1085],[1070,1085],[1070,1108],[226,1108]]},{"text":"unit was said to have seized power, but seized only one print shop. Yet they refused to","box":[[226,1148],[1084,1148],[1084,1175],[226,1175]]},{"text":"let other units to print things there. This kind of power seizure, Zhang commented,","box":[[226,1215],[1048,1215],[1048,1238],[226,1238]]},{"text":"was a take-over based on small-groupism. This in fact converted the ownership by the","box":[[227,1279],[1082,1279],[1082,1303],[227,1303]]},{"text":"whole people into the ownership by a small group and thus wrecked the building of","box":[[227,1342],[1060,1343],[1060,1370],[227,1369]]},{"text":"socialism. This is the kind of thing, Zhang siad, that was advocated by the","box":[[225,1407],[961,1408],[961,1435],[225,1434]]},{"text":"Yugoslavian revisionist regime. Zhang stressed that the so-called workers? control in","box":[[227,1472],[1070,1472],[1070,1502],[227,1502]]},{"text":"84Ibid.p.260.","box":[[221,1576],[334,1582],[332,1610],[219,1604]]},{"text":"484","box":[[640,1629],[673,1629],[673,1653],[640,1653]]}],"dimensions":{"height":1755,"width":1241}}