{"ocr_results":[{"text":"exposed the reactionary nature of the argument made by this faction that all thepeople","box":[[228,175],[1087,175],[1087,198],[228,198]]},{"text":"with the titles of “zhang”(directors) were riding the Party and people's necks.For","box":[[226,238],[1043,239],[1043,263],[226,262]]},{"text":"example, the dismissed defense minister Peng Dehuai was a defense minister, and Lin","box":[[226,304],[1083,303],[1083,327],[226,328]]},{"text":"Biao was a defense minister, too. One could say that Peng Dehuai rode the Party and","box":[[223,365],[1072,366],[1072,396],[223,395]]},{"text":"people's necks, but one could not say that comrade Lin Biao was riding the Party and","box":[[225,434],[1075,432],[1075,459],[225,461]]},{"text":"people's necks. Zhang Chunqiao hypothesized that these two ministers belonged to","box":[[225,499],[1052,498],[1052,524],[225,526]]},{"text":"two different classes. Without class analysis, there was no way in reality to practice","box":[[225,562],[1056,563],[1056,590],[225,589]]},{"text":"the three-in-one combination. In refuting some people's opposition to the slogan of","box":[[225,627],[1055,628],[1055,656],[225,655]]},{"text":"\"all power to the Shanghai People's Commune” and these opponents' claim that the","box":[[227,691],[1062,692],[1062,722],[227,721]]},{"text":"Commune was merely set up by “a handful of people\", Zhang emphasized that the","box":[[225,757],[1047,759],[1047,786],[225,784]]},{"text":"political foundation of the Shanghai Commune was firmly based on the January","box":[[226,825],[1019,825],[1019,849],[226,849]]},{"text":"Revolution, a great revolution in which one class overthrew another and involved","box":[[226,888],[1039,887],[1039,911],[226,912]]},{"text":"many Shanghai rebels. Seeing the power seizure from beginning to end, the Center,","box":[[225,952],[1057,954],[1057,981],[225,979]]},{"text":"especially Chairman Mao himself, approved “A Letter to the People of the Whole","box":[[229,1020],[1039,1020],[1039,1044],[229,1044]]},{"text":"City\" and the “Urgent Notice\" issued by the Shanghai rebels. After this, the Central","box":[[227,1083],[1060,1083],[1060,1110],[227,1110]]},{"text":"Committee, the State Council, the Military Committee, and the CCRG jointly sent a","box":[[225,1147],[1063,1148],[1063,1175],[225,1174]]},{"text":"congratulatory telegram“Message of Greetings to Revolutionary Rebel Organizations","box":[[225,1213],[1084,1214],[1084,1240],[225,1239]]},{"text":"in Shanghai''. How could one say that the Shanghai Commune was set up by only a","box":[[226,1279],[1059,1279],[1059,1303],[226,1303]]},{"text":"handful of people when it had so profound mass support? In regard to some","box":[[227,1345],[981,1345],[981,1369],[227,1369]]},{"text":"individuals’ accusation that Zhang singlehandedly set up the Shanghai Commune.","box":[[224,1407],[1040,1409],[1040,1436],[224,1434]]},{"text":"Zhang first humorously expressed his thanks to them and then said that he did not","box":[[226,1473],[1042,1473],[1042,1500],[226,1500]]},{"text":"have such magic powers. As for those who were driven by personal ambition, and","box":[[227,1540],[1042,1540],[1042,1564],[227,1564]]},{"text":"486","box":[[642,1631],[672,1631],[672,1652],[642,1652]]}],"dimensions":{"height":1755,"width":1241}}