{"ocr_results":[{"text":"dissertation attempts to recover this lost yet crucial history by exploring in historical","box":[[225,174],[1066,172],[1066,199],[225,200]]},{"text":"detail the origin, development and supersession of theShanghai Commune.","box":[[228,240],[977,240],[977,263],[228,263]]},{"text":"Examining the role of different mass organizations during the January Storm in","box":[[225,302],[1016,303],[1016,330],[225,329]]},{"text":"Shanghai, I attempt to offer a full picture of the Maoist mass movement based on the","box":[[226,368],[1072,367],[1072,394],[226,395]]},{"text":"theory of continuous revolution. Disagreeing with some critics’ arguments that the","box":[[226,433],[1044,433],[1044,460],[226,460]]},{"text":"Shanghai Commune was a negation of the party-state, I argue that it neither negated","box":[[226,498],[1064,497],[1064,524],[226,526]]},{"text":"the party nor the state. Instead, the Shanghai Commune embodied the seeds of a novel","box":[[224,561],[1087,562],[1087,589],[224,588]]},{"text":"state structure that empowers the masses by relegating some of the state power to","box":[[224,627],[1038,629],[1038,655],[224,653]]},{"text":"mass representatives and mass organs. Differing from the common narrative and most","box":[[224,693],[1087,692],[1087,719],[224,720]]},{"text":"scholarship in the post-Mao era, I argue that the commune movement in the beginning","box":[[226,756],[1085,758],[1085,788],[226,786]]},{"text":"of 1967 facilitated revolutionary changes in Chinese society and state structure. The","box":[[224,822],[1065,823],[1065,850],[224,849]]},{"text":"Shanghai Commune and the Shanghai Revolutionary Committee developed as ruling","box":[[227,888],[1074,888],[1074,915],[227,915]]},{"text":"bodies that did not hold general elections or abolish the standing army and in this way","box":[[225,951],[1083,953],[1083,980],[225,978]]},{"text":"did not replicate the Paris Commune. But in contrast to the old Shanghai organs of","box":[[228,1019],[1050,1019],[1050,1043],[228,1043]]},{"text":"power, they were largely in conformity with the principles of the Paris Commune by","box":[[226,1085],[1065,1084],[1065,1108],[226,1109]]},{"text":"smashing the Old and establishing the New.Some of their creativemeasures,","box":[[227,1150],[994,1150],[994,1173],[227,1173]]},{"text":"“socialist new things\", anticipated the features of a communal state -a state that does","box":[[229,1213],[1074,1213],[1074,1239],[229,1239]]},{"text":"not eradicate class struggle yet begins to initiate the long process of the withering","box":[[225,1277],[1038,1278],[1038,1305],[225,1304]]},{"text":"awayof thestateitself.","box":[[224,1341],[455,1343],[454,1371],[224,1369]]},{"text":"V","box":[[653,1637],[661,1637],[661,1648],[653,1648]]}],"dimensions":{"height":1755,"width":1241}}