{"ocr_results":[{"text":"aimed tocast asidethe degeneratedparts of thebureaucracy and thosepartsof the","box":[[227,175],[1043,175],[1043,198],[227,198]]},{"text":"Party that were onto the track of a capitalist road. It attempts to urge the degenerated","box":[[224,236],[1070,237],[1070,264],[224,263]]},{"text":"power holders to return to the socialist and communist line of serving the people","box":[[227,304],[1031,304],[1031,328],[227,328]]},{"text":"When the Liu-Dengist power holders put the Maoist revolutionaries under pressure","box":[[224,365],[1056,366],[1056,396],[224,395]]},{"text":"and rejected their petition for re-revolutionizing by encouraging the wind of","box":[[227,435],[983,435],[983,459],[227,459]]},{"text":"economism and carrying out general strikes, the Maoists had to upgrade their","box":[[224,499],[996,498],[996,524],[224,526]]},{"text":"struggles to a full scale power seizure from the power holders. Therefore, the","box":[[226,564],[991,563],[991,587],[226,588]]},{"text":"intensified newstrugglewasfirst of all not designed to establish a revolutionary","box":[[226,628],[1023,629],[1023,653],[226,652]]},{"text":"democratic power organ similar to that of the Paris Commune, but to establish a new","box":[[225,693],[1071,692],[1071,719],[225,720]]},{"text":"revolutionary socialist power organ by adopting a wholly new form of state structure","box":[[226,760],[1075,760],[1075,784],[226,784]]},{"text":"As I have argued before, even though in classical Marxist interpretations, the Paris","box":[[227,824],[1049,825],[1049,849],[227,848]]},{"text":"Commune is a concrete example of a dictatorship of the proletariat, it is just a","box":[[224,885],[1002,889],[1002,915],[224,912]]},{"text":"rudimentary one and not a dictatorship of the proletariat under socialism. It was more,","box":[[227,954],[1083,954],[1083,978],[227,978]]},{"text":"as Lenin labeled it, a revolutionary democratic dictatorship that did not abolish private","box":[[226,1018],[1086,1019],[1086,1043],[226,1042]]},{"text":"property. As we know, the anti-Paris Commune bourgeois forces and their followers","box":[[225,1084],[1065,1080],[1065,1107],[225,1111]]},{"text":"were largely excluded from Paris. Moreover, the Paris Commune did not produce a","box":[[227,1150],[1054,1150],[1054,1173],[227,1173]]},{"text":"visible political agenda to expropriate the expropriators, even though it might have","box":[[229,1215],[1050,1215],[1050,1238],[229,1238]]},{"text":"such intentions in keeping with Marx's hypothesis. Therefore, by winning the healthy","box":[[225,1277],[1076,1278],[1076,1305],[225,1304]]},{"text":"parts of the bourgeoisie over, the Paris Commune was able to institute a general","box":[[225,1344],[1021,1342],[1021,1369],[225,1371]]},{"text":"election and functioned as a revolutionary democratic power organ in1871. But to","box":[[227,1408],[1049,1411],[1049,1435],[227,1432]]},{"text":"date a socialist government has never been successfully elected through universal","box":[[226,1474],[1038,1475],[1038,1499],[226,1498]]},{"text":"suffrage at the state level, which abolishes class-property that makes the labour of the","box":[[226,1538],[1077,1537],[1077,1564],[226,1565]]},{"text":"510","box":[[641,1631],[674,1631],[674,1653],[641,1653]]}],"dimensions":{"height":1755,"width":1241}}