{"ocr_results":[{"text":"1976,a political gathering in memory of theParis Commune took place at the","box":[[229,175],[1002,175],[1002,198],[229,198]]},{"text":"University of Aeronautics and Astronautics in Beijing. On their own initiative rather","box":[[225,237],[1067,236],[1067,263],[225,264]]},{"text":"than that of the Party, forty Communists Party members attended a commemoration of","box":[[226,303],[1091,303],[1091,330],[226,330]]},{"text":"the 137th anniversary of the Paris Commune. Except for ten college students, most","box":[[225,366],[1048,369],[1048,396],[225,393]]},{"text":"participants were former Red Guards and retired high Party cadres. Their parents were","box":[[224,434],[1089,432],[1089,459],[224,461]]},{"text":"usually old revolutionaries, and they themselves graduated from elite schools, such as","box":[[225,498],[1083,499],[1083,526],[225,524]]},{"text":"the Yan'an Nursery School, the Yucai School, the August 1 School, and the No. 101","box":[[225,562],[1059,561],[1059,588],[225,589]]},{"text":"Middle School, which were schools mainly for children of Party's cadres even dated","box":[[224,626],[1068,628],[1068,655],[224,653]]},{"text":"back to the Yan'an era. This meeting reaffirmed the most important principles of the","box":[[223,690],[1065,692],[1065,722],[223,720]]},{"text":"Paris Commune: the working class cannot simply lay hold of the ready-made state","box":[[223,757],[1049,759],[1049,786],[223,784]]},{"text":"machinery, and use it for its own purposes. That is, the proletariat should use","box":[[225,824],[991,825],[991,849],[225,848]]},{"text":"revolutionary means to seize state power, smash the military bureaucratic machine of","box":[[226,889],[1077,889],[1077,913],[226,913]]},{"text":"thebourgeoisie, and establish the dictatorship of the proletariat to replace the","box":[[227,954],[993,954],[993,978],[227,978]]},{"text":"dictatorship of thebourgeoisie. To ensure that administrators are not to transform into","box":[[227,1019],[1079,1019],[1079,1042],[227,1042]]},{"text":"bureaucrats, all administrators should be elected by universal suffrage from the","box":[[225,1082],[1013,1084],[1013,1108],[225,1106]]},{"text":"bottom up. They should be subjected to recall at any time and their salary should not","box":[[227,1150],[1069,1150],[1069,1174],[227,1174]]},{"text":"exceed that of a working man. In this meeting, Professor Xu fei from the","box":[[227,1215],[951,1215],[951,1238],[227,1238]]},{"text":"CommunicationUniversity of China tookMarx's Civil WarinFranceinhand and","box":[[226,1277],[1043,1278],[1043,1302],[226,1301]]},{"text":"said that it was necessary to combine Marxist theory with practice, and that it was","box":[[225,1342],[1043,1343],[1043,1370],[225,1369]]},{"text":"important to understand Engels'*Introduction [to Karl Marx's the Civil War in","box":[[224,1407],[1008,1408],[1008,1435],[224,1434]]},{"text":"France]\". One of the key issues of the meeting was to defend the right to make violent","box":[[224,1473],[1090,1474],[1090,1501],[224,1500]]},{"text":"revolution and oppose the Chinese “democratic socialists\". Professor Zuo Dapei from","box":[[226,1540],[1079,1540],[1079,1564],[226,1564]]},{"text":"547","box":[[642,1631],[672,1631],[672,1652],[642,1652]]}],"dimensions":{"height":1755,"width":1241}}